{"title":"Electric","index":{"title":"Home","description":"Create beautiful documentation for your projects","content":" Copyright © 2016 Liferay, Inc Powered by WeDeploy™ ","srcFilePath":"src/pages/index.soy","url":"/.","children":[{"children":[{"description":"Getting started with a electric project.","icon":"arrow-right-rod","layout":"docs","title":"Getting Started","weight":1,"content":" Yeoman Generator The Yeoman Generator is the fastest way to get an electric project up and running. Install dependencies. npm i -g gulp yo Install generator. npm i -g generator-electric Run the generator with yo electric in the command line. This will prompt you for a project id and name, then it creates a folder in your current directory with your new electric project. Having issues getting the generator running? Check out Yeoman's FAQs for troubleshooting tips. Project Dependencies All dependencies are adding automatically when using the Yeoman Generator, but when creating a project from scratch, the following dependencies must be added to the project. npm i --save gulp electric Projects Using Electric Electricjs.com ","srcFilePath":"src/pages/docs/getting-started.md","url":"/docs/getting-started.html"},{"description":"Gulp tasks for site generating, and configuration options.","icon":"gear","layout":"docs","title":"Tasks","weight":2,"content":" Registering All tasks are registered in the project's gulpfile.js. const gulp = require('gulp'); const electric = require('electric'); electric.registerTasks({ gulp: gulp }); Available Tasks Generate To generate your distribution files, simple run the following command. gulp generate This will render all soy and markdown files from src into HTML and place them in the dist folder. Configuration registerTasks gulp Required: true Type: Gulp instance An instance of gulp. markdownOptions Required: false Type: Object An Object Literal containing configuration options for Remarkable which is used to render Markdown files. Example: ssg.registerTasks({ gulp: gulp, markdownOptions: { breaks: true } }); See Remarkable's documentation for list of options. pathDest Required: false Type: String Default: dist The path that generated files are placed in. Example: ssg.registerTasks({ gulp: gulp, pathDest: 'build' }); Now all generated files will be placed in the build directory. pathSrc Required: false Type: String Default: src The path where all source files are located. Example: ssg.registerTasks({ gulp: gulp, pathSrc: 'web' }); Now electric will look inside the web directory for all source files. plugins Required: false Type: Array Array of npm modules that expose Metal components. Example: electric.registerTasks({ gulp: gulp, plugins: ['electric-components'] }); The components found in the electric-components package will now be available to all soy files in your project. Note that every package listed in plugins must also be listed as a dependency in the project's package.json. taskPrefix Required: false Type: String String that is prefixed to every task exposed by electric. Example: ssg.registerTasks({ gulp: gulp, taskPrefix: 'ssg:' }); The generate task will now be exposed as ssg:generate. This option allows you to implement electric in conjunction with other packages that expose gulp tasks without the risk of overwriting previously defined tasks. ","srcFilePath":"src/pages/docs/tasks.md","url":"/docs/tasks.html"},{"description":"Basic project structure and boilerplate.","icon":"folder","layout":"docs","title":"Project Structure","weight":3,"content":" Structure Here is a basic example of an electric project. |--gulpfile.js (registers tasks) |--src/ |--site.json |--layouts/ |--base.soy (required base template) |--docs.soy |--pages/ |--index.soy (required index page) |--docs/ |--index.soy |--create.soy (soy rendered to html) |--deploy.md (markdown rendered to html) |--parent/ |--index.md |--child.md site.json This file contains meta data about your project. Any property can be added to this file. Front matter from pages is merged with this data and passed to every page as a soy param. Layouts The file structure of layouts is flexible, as soy uses the namespace of every file as an identifier. All layout files must be a soy template, and the only required layout is base.soy. See layouts for more information. Pages Every file in pages with a .soy or .md extension is rendered to HTML during the generate task. The file structure of pages determines the urls of your pages. For the above example, the child.md file will be located at /docs/parent/child.html after generating. Pages named index will be located at the path of it's parent directory, so pages/docs/index.soy will be available at /docs/. See pages for more information. ","srcFilePath":"src/pages/docs/project-structure.md","url":"/docs/project-structure.html"},{"description":"Documentation on base layout and sub layouts.","icon":"code-file","layout":"docs","title":"Layouts","weight":4,"content":" Base Layout All projects must have a layouts/base.soy file. This file is responsible for the HTML boilerplate of your site. Every page will be rendered with this layout. {lb}namespace base{rb} /** @param content @param page @param serialized @param site */ {lb}template .render private=\"true\"{rb} {lb}$page.title{rb} - {lb}$site.title{rb} {lb}$content{rb} {lb}/template{rb} This layout can be editted to fit the needs of your project, but it must use base as the namespace, and it must include the {lb}$content{rb} variable which renders the content of each page. Metal Component Invocation The ` and ` are not just comments, during the generate task they are replaced with the necessary code for automatically invoking Metal components that have been implemented in your project's soy files. Note: these tags only needed to be included in the base template. The injected code is what implements the serialized param that is defined at the start of the template. serialized is stringified meta data that Metal consumes to render each page. Sub Layouts Additional layouts can be created in the layouts folder of your project. These layouts are simply soy templates that can be implemented by individual pages. {lb}namespace docs{rb} /** @param content @param elementClasses @param page @param site */ {lb}template .render{rb} {lb}$site.title{rb} {lb}$page.title{rb} {lb}$content{rb} {lb}/template{rb} This template can be implemented by both soy and markdown files. The following example implements the docs layout. soy example. --- description: \"Page description.\" title: \"Page\" --- {lb}namespace page{rb} /** */ {lb}template .render{rb} {lb}call docs.render data=\"all\"{rb} {lb}param content kind=\"html{rb} Hello, World! {lb}/param{rb} {lb}/call{rb} {lb}/template{rb} Sub layouts are rendered using soy's call command. The data=\"all\" property needs to be set if the layout in question needs to implement any of the global params (site or page). markdown example. Markdown implementation doesn't require any soy code, rather it leverages the front matter layout property to determine the layout. --- description: \"Page description.\" layout: \"docs\" title: \"Page\" --- Hello, World! By specifying layout: \"docs\", the generator will look for a soy template in the layouts directory with the docs namespace. See the section on configuration for info on configuring the markdown engine. ","srcFilePath":"src/pages/docs/layouts.md","url":"/docs/layouts.html"},{"description":"Creating pages in soy and markdown.","icon":"code-file","layout":"docs","title":"Pages","weight":5,"content":" Front Matter All files in the pages directory must have the following front matter declared at the beginning of the file. --- title: \"Page Title\" description: \"Description.\" --- The title property will be used for auto-generated navigation elements and as the page's ``. Both the title and description properties will be used for search functionality. Soy All files ending with the .soy extension will be rendered as soy templates. --- description: \"Page description.\" title: \"Page\" --- {lb}namespace page{rb} /** */ {lb}template .render{rb} Hello, World! {lb}/template{rb} Note: all namespace properties must be unique across all files within the src directory, and every soy file must define a .render template. Site/Page Data Every page is passed a site and page param. The page param represents the front matter of the current file. {$page.title} {$page.description} The site param contains project meta data such as site.title and site.repo. It also contains the structure of the entire site which can be used to generate navigation elements. This structure data is defined as the site.index property representing the index page of the project. {$site.title} {$site.index} This data is pulled from the dist/site.json file. Additional properties can be added to this data by editing the src/site.json file. Markdown Markdown files are intended for easier writing of documentation and content, these files are rendered to HTML and then wrapped in a soy template and rendered along all soy pages. The namespace is also auto-generated based on the file path, so it does not need to be declared at the top of the file. --- description: \"Page description.\" layout: \"docs\" title: \"Page\" --- Hello, World! It's important to note that because markdown files are wrapped in soy templates, that some content may need to be sanitized of soy related syntax (such as curly braces). --- description: \"Page description.\" layout: \"docs\" title: \"Page\" --- Hello, World! {lb}literal{rb} var example = function() {lb} return 'Example js'; {rb} {lb}/literal{rb} See google's documentation for more info. ","srcFilePath":"src/pages/docs/pages.md","url":"/docs/pages.html"},{"description":"Creating and rendering Metal components.","icon":"module","layout":"docs","title":"Metal Components","weight":6,"content":" Creating Components One of the major benefits of electric is the ability to create metal.js components and invoke them in your soy layouts and pages. Components can exist anywhere in the src directory, for this example we will place them inside src/components. |--src/ |--layouts/ |--base.soy |--docs.soy |--pages/ |--index.soy |--components/ |--MyComponent.soy |--MyComponent.js MyComponent.soy. {lb}namespace MyComponent{rb} /** */ {lb}template .render{rb} Hello, World! {lb}/template{rb} MyComponent.js. 'use strict'; import Component from 'metal-component'; import Soy from 'metal-soy'; import templates from './MyComponent.soy'; class MyComponent extends Component { attached() { console.log('MyComponent attached!'); } }; Soy.register(MyComponent, templates); export default MyComponent; Now that you have the base component files, the MyComponent template simply needs to be rendered in a page/layout. Rendering Components To render a metal component in a page/layout, simply use the call command to render the .render template of the component. --- description: \"Page description.\" title: \"Page\" --- {lb}namespace page{rb} /** */ {lb}template .render{rb} {lb}call MyComponent.render /{rb} {lb}/template{rb} Now you should see 'MyComponent attached!' in the browser console. Electric Components The electric-components package contains a number of components that are compatible with the site meta data, such as navigation and search components. See configuration for information on adding plugins to your project. These components are invoked the same way as your own components. --- description: \"Page description.\" title: \"Page\" --- {lb}namespace page{rb} /** @param site */ {lb}template .render{rb} {lb}call ElectricNavigation.render{rb} {lb}param depth: 1 /{rb} {lb}param section: $site.index /{rb} {lb}/call{rb} {lb}/template{rb} This will render a list with all direct descendants of the index page. ","srcFilePath":"src/pages/docs/metal-components.md","url":"/docs/metal-components.html"}],"description":"List of articles documenting electric.","title":"Documentation","content":" Electric Docs Start learning how to leverage the power of Electric. Choose a Guide ","srcFilePath":"src/pages/docs/index.soy","url":"/docs"},{"title":"Updates","description":"Release information for electric.","updates":[{"version":"0.1.0","major":false,"features":[{"icon":"hammer","title":"Initial release","description":"Implements basic site generation with soy, markdown, and metal.","url":"https://github.com/liferay/electric/commit/19f600816770ea7aa1ae6939c777be4e5d4c5d9a"}]}],"content":" Updates Check out what's new. ","srcFilePath":"src/pages/updates/index.soy","url":"/updates"}]},"repo":"https://github.com/Robert-Frampton/metal-ssg-docs"}